app/views/recommendations/user_recommendation.html.erb

          <tr>
            <% if Book.find_by(isbn: r.isbn).nil? %>
---
SELECT  "books".* FROM "books" WHERE "books"."isbn" = ? LIMIT 1  [["isbn", "54545465465"]]