app/views/books/index.html.erb

SELECT "books".* FROM "books" WHERE (title LIKE '%Peace%' OR description LIKE '%Peace%' OR isbn LIKE '%Peace%' OR authors LIKE '%Peace%' OR status LIKE '%Peace%' OR borrower LIKE '%Peace%')  ORDER BY created_at DESC
---
        <% if (book.status == "Checked out") %>
            <% if (current_user && !current_user.books.find_by_id(book.id).nil?) %>