app/views/books/show.html.erb


      : <%= @book.checkouts.order("created_at DESC").first.user.email unless @book.checkouts.order("created_at DESC").first.nil? %>
---
SELECT  "checkouts".* FROM "checkouts" WHERE "checkouts"."book_id" = ?  ORDER BY created_at DESC LIMIT 1  [["book_id", 5]]