app/views/checkouts/show_book.html.erb

SELECT  "checkouts".* FROM "checkouts" WHERE "checkouts"."book_id" = ?  ORDER BY "checkouts"."id" ASC LIMIT 1  [["book_id", 5]]
---
<h3>Checkout History</h3>
<% if !@book.checkouts.first.nil? %>