app/views/checkouts/show_user.html.erb

SELECT  "checkouts".* FROM "checkouts" WHERE "checkouts"."user_id" = ?  ORDER BY "checkouts"."id" ASC LIMIT 1  [["user_id", 3]]
---

<% if !@user.checkouts.first.nil? %>