app/controllers/admins_controller.rb

  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save
---
INSERT INTO "admins" ("email", "name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "admin@ncsu.edu"], ["name", "admin"], ["password", "password"], ["created_at", "2015-09-30 01:50:22.236495"], ["updated_at", "2015-09-30 01:50:22.236495"]]

  def update
    respond_to do |format|
      if @admin.update(admin_params)
---
UPDATE "admins" SET "name" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["name", "Moharnab"], ["updated_at", "2015-09-24 15:18:07.878141"], ["id", 1]]

  def destroy
    @admin.destroy
---
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 4]]