app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (title LIKE '%Peace%' OR description LIKE '%Peace%' OR isbn LIKE '%Peace%' OR authors LIKE '%Peace%' OR status LIKE '%Peace%' OR borrower LIKE '%Peace%')  ORDER BY created_at DESC
---
  def index
    @books = Book.all

SELECT "books".* FROM "books"  ORDER BY created_at DESC
---
  def indexForMembers
    @books = Book.all

INSERT INTO "books" ("title", "description", "authors", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "foobar"], ["description", "foo"], ["authors", "bar"], ["status", "available"], ["created_at", "2015-09-23 01:39:02.864273"], ["updated_at", "2015-09-23 01:39:02.864273"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save