app/controllers/checkouts_controller.rb

  def show_book
    #respond_to do |format|
    if admin_logged_in?
      @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 5]]

  def show_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]

  def create
    @book = Book.find(params[:id])
    respond_to do |format|
      if @book.checkouts.create(user: current_user, created_at: Time.now)
        @book.update(status: "Checked out")
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "checkouts" ("user_id", "created_at", "book_id", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["created_at", "2015-10-07 07:49:27.639629"], ["book_id", 1], ["updated_at", "2015-10-07 07:49:27.687633"]]
UPDATE "books" SET "status" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["status", "Checked out"], ["updated_at", "2015-10-07 07:49:27.880336"], ["id", 1]]

  def create_admin
    @book = Book.find(params[:id])
    @user = User.find_by(email: params[:user][:email])
    respond_to do |format|
      if @user.nil?
        format.html { redirect_to @book, notice: 'Invalid user!' }

      elsif @book.checkouts.create(user: @user, created_at: Time.now)
        @book.update(status: "Checked out")
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "moharnab123saikia@gmail.com"]]
INSERT INTO "checkouts" ("user_id", "created_at", "book_id", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["created_at", "2015-10-07 09:03:35.767859"], ["book_id", 1], ["updated_at", "2015-10-07 09:03:35.825844"]]
UPDATE "books" SET "status" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["status", "Checked out"], ["updated_at", "2015-10-07 09:03:35.994707"], ["id", 1]]

  def update
    @book = Book.find(params[:id])
    respond_to do |format|
      if @book.checkouts.last.update_attributes(updated_at: Time.now)
        if !@book.notifications.nil?
          @book.notifications.each do |x|
            UserMailer.book_available_notification(x.user, @book).deliver
            x.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "checkouts".* FROM "checkouts" WHERE "checkouts"."book_id" = ?  ORDER BY "checkouts"."id" DESC LIMIT 1  [["book_id", 5]]
UPDATE "books" SET "status" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["status", "In Library"], ["updated_at", "2015-10-07 07:49:34.002774"], ["id", 1]]
UPDATE "checkouts" SET "updated_at" = ? WHERE "checkouts"."id" = ?  [["updated_at", "2015-10-07 07:49:33.895768"], ["id", 13]]
SELECT "notifications".* FROM "notifications" WHERE "notifications"."book_id" = ?  [["book_id", 3]]
DELETE FROM "notifications" WHERE "notifications"."id" = ?  [["id", 1]]