app/controllers/notifications_controller.rb

  def create
    @book = Book.find(params[:id])
    respond_to do |format|
      if @book.notifications.create(user: current_user, created_at: Time.now)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "notifications" ("user_id", "created_at", "book_id", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["created_at", "2015-10-07 19:55:28.087278"], ["book_id", 1], ["updated_at", "2015-10-07 19:55:28.110255"]]