app/controllers/recommendations_controller.rb

  def index
    @recommendations = Recommendation.all
---
SELECT "recommendations".* FROM "recommendations"  ORDER BY created_at DESC

  def create
    respond_to do |format|
      if current_user.recommendations.create(recommendation_params)
---
INSERT INTO "recommendations" ("isbn", "title", "desc", "author", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @recommendation = Recommendation.find(params[:id])
---
SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = ? LIMIT 1  [["id", 2]]

  def update
    @recommendation = Recommendation.find(params[:id])
    @recommendation.status = "Accepted"
    respond_to do |format|
      if @recommendation.update_attributes(recommendation_params)
---
SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "recommendations" SET "status" = ?, "updated_at" = ? WHERE "recommendations"."id" = ?  [["status", "Accepted"], ["updated_at", "2015-10-08 02:41:48.747985"], ["id", 2]]