app/controllers/sessions_controller.rb

  def create_user
    user = User.find_by(email: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", ""]]

  def create_admin
    admin = Admin.find_by(email: params[:session][:email].downcase)
---
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT 1  [["email", "moharnab@gmail.com"]]