app/controllers/users_controller.rb

SELECT "books".* FROM "books" INNER JOIN "checkouts" ON "books"."id" = "checkouts"."book_id" WHERE "checkouts"."user_id" = ?  [["user_id", 3]]
SELECT "checkouts".* FROM "checkouts" WHERE "checkouts"."user_id" = ?  [["user_id", 3]]
DELETE FROM "checkouts" WHERE "checkouts"."id" = ?  [["id", 13]]
---
  def destroy
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.checkouts.any? {|x| x.book.status == "Checked out" }
        format.html { redirect_to users_url, notice: 'User has books checked out.Can\'t delete' }
      else
        @user.destroy