app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "newOne"], ["name", "new"], ["password", "pwd"], ["created_at", "2015-09-23 05:07:49.440823"], ["updated_at", "2015-09-23 05:07:49.440823"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "name" = ?, "password" = ?, "status" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "newone@gmail.com"], ["name", "new hkjhkj"], ["password", "password"], ["status", ""], ["updated_at", "2015-09-24 15:16:55.000482"], ["id", 2]]